src/InformationRegisters/АктуальныеСостоянияДокументовМЭДО/АктуальныеСостоянияДокументовМЭДО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>АктуальныеСостоянияДокументовМЭДО</name>
  <comment>Для отборов в форме списка</comment>
  <resources>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияДокументовМЭДО</types>
    </type>
  </resources>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DefinedType.ПредметМЭДО</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/СостоянияДокументовМЭДО/СостоянияДокументовМЭДО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СостоянияДокументовМЭДО</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ИдентификаторДокумента</name>
    <comment>Для входящего - из паспорта сообщения МЭДО, для исходящего - наш GUID из ссылки на документ</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИдентификаторСообщения</name>
    <comment>Для входящего из электронного сообщения. Для исходящего - генерируется системой</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПредметСообщения</name>
    <type>
      <types>DefinedType.ПредметСообщенияМЭДО</types>
    </type>
  </resources>
  <resources>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияДокументовМЭДО</types>
    </type>
  </resources>
  <dimensions>
    <name>Направление</name>
    <type>
      <types>EnumRef.НаправленияСообщенийМЭДО</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DefinedType.ПредметМЭДО</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/АктуальныеСостоянияДокументовМЭДО/ManagerModule.bsl
// @strict-types

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Обновить актуальное состояние.
// 
// Параметры:
//  Документ - ОпределяемыйТип.ПредметМЭДО - Документ
//  Состояние - ПеречислениеСсылка.СостоянияДокументовМЭДО - Состояние, какое нужно записать.
// 
// Возвращаемое значение:
//  Булево - Произведена запись или нет.
Функция ОбновитьСостояние(Документ) Экспорт
	
	Если Не ЗначениеЗаполнено(Документ) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТекущееЗаписанноеСостояние = ПолучитьСостояние(Документ);
	
	СрезСостояния = РегистрыСведений.СостоянияДокументовМЭДО.ПолучитьСрезСостоянияДокумента(
		Документ, Неопределено, "Состояние", ТекущаяДатаСеанса(), Неопределено);
	Если Не ЗначениеЗаполнено(СрезСостояния.Состояние) Тогда
		СрезСостояния.Состояние = Перечисления.СостоянияДокументовМЭДО.ПустаяСсылка();
	КонецЕсли;
	Если ТекущееЗаписанноеСостояние = СрезСостояния.Состояние Тогда
		Возврат Ложь; // уже есть.
	КонецЕсли;
	
	Набор = СоздатьНаборЗаписей();
	Набор.Отбор.Документ.Установить(Документ);
	Запись = Набор.Добавить();
	Запись.Документ = Документ;
	Запись.Состояние = СрезСостояния.Состояние;
	Набор.Записать();
	
	Возврат Истина;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Получить актуальное состояние документа.
// 
// Параметры:
//  Документ - ОпределяемыйТип.ПредметМЭДО - Документ
// 
// Возвращаемое значение:
//  ПеречислениеСсылка.СостоянияДокументовМЭДО, Произвольный - Получить состояние
Функция ПолучитьСостояние(Документ)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	Состояния.Состояние
		|ИЗ
		|	РегистрСведений.АктуальныеСостоянияДокументовМЭДО КАК Состояния
		|ГДЕ
		|	Состояния.Документ = &Документ");
	Запрос.УстановитьПараметр("Документ", Документ);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Состояние;
	КонецЕсли;
	
	Возврат Перечисления.СостоянияДокументовМЭДО.ПустаяСсылка();
	
КонецФункции

#КонецОбласти

#КонецЕсли
